Black8Mamba/IMXRT1052_for_fireboard/board/pin_mux.h
/* GPIO_SD_B0_02 (coord J1), SD1_D0/J24[4]/SPI_MOSI/PWM */
/* Routed pin properties */
#define BOARD_USDHC_SD1_D0_PERIPHERAL                                     USDHC1   /*!< Peripheral name */
#define BOARD_USDHC_SD1_D0_SIGNAL                                     usdhc_data   /*!< Signal name */
#define BOARD_USDHC_SD1_D0_CHANNEL                                            0U   /*!< Signal channel */

/* GPIO_SD_B0_03 (coord K1), SD1_D1/J24[5]/SPI_MISO */
/* Routed pin properties */
#define BOARD_USDHC_SD1_D1_PERIPHERAL                                     USDHC1   /*!< Peripheral name */
#define BOARD_USDHC_SD1_D1_SIGNAL                                     usdhc_data   /*!< Signal name */
#define BOARD_USDHC_SD1_D1_CHANNEL                                            1U   /*!< Signal channel */

/* GPIO_SD_B0_04 (coord H2), SD1_D2 */
/* Routed pin properties */
#define BOARD_USDHC_SD1_D2_PERIPHERAL                                     USDHC1   /*!< Peripheral name */
#define BOARD_USDHC_SD1_D2_SIGNAL                                     usdhc_data   /*!< Signal name */
#define BOARD_USDHC_SD1_D2_CHANNEL                                            2U   /*!< Signal channel */

/* GPIO_SD_B0_05 (coord J2), SD1_D3 */
/* Routed pin properties */
#define BOARD_USDHC_SD1_D3_PERIPHERAL                                     USDHC1   /*!< Peripheral name */
#define BOARD_USDHC_SD1_D3_SIGNAL                                     usdhc_data   /*!< Signal name */
#define BOARD_USDHC_SD1_D3_CHANNEL                                            3U   /*!< Signal channel */

/* GPIO_B1_14 (coord C14), SD0_VSELECT */
/* Routed pin properties */
#define BOARD_USDHC_SD0_VSELECT_PERIPHERAL                                USDHC1   /*!< Peripheral name */
#define BOARD_USDHC_SD0_VSELECT_SIGNAL                             usdhc_vselect   /*!< Signal name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_USDHC(void);

/* GPIO_SD_B1_06 (coord L3), FlexSPI_SS0 */
/* Routed pin properties */
#define BOARD_INITFLEXSPI_FlexSPI_SS0_PERIPHERAL                         FLEXSPI   /*!< Peripheral name */
#define BOARD_INITFLEXSPI_FlexSPI_SS0_SIGNAL                     FLEXSPI_A_SS0_B   /*!< Signal name */

/* GPIO_SD_B1_08 (coord P3), FlexSPI_D0_A */
/* Routed pin properties */
#define BOARD_INITFLEXSPI_FlexSPI_D0_A_PERIPHERAL                        FLEXSPI   /*!< Peripheral name */
#define BOARD_INITFLEXSPI_FlexSPI_D0_A_SIGNAL                    FLEXSPI_A_DATA0   /*!< Signal name */

/* GPIO_SD_B1_09 (coord N4), FlexSPI_D1_A */
/* Routed pin properties */
#define BOARD_INITFLEXSPI_FlexSPI_D1_A_PERIPHERAL                        FLEXSPI   /*!< Peripheral name */
#define BOARD_INITFLEXSPI_FlexSPI_D1_A_SIGNAL                    FLEXSPI_A_DATA1   /*!< Signal name */

/* GPIO_SD_B1_10 (coord P4), FlexSPI_D2_A */
/* Routed pin properties */
#define BOARD_INITFLEXSPI_FlexSPI_D2_A_PERIPHERAL                        FLEXSPI   /*!< Peripheral name */
#define BOARD_INITFLEXSPI_FlexSPI_D2_A_SIGNAL                    FLEXSPI_A_DATA2   /*!< Signal name */

/* GPIO_SD_B1_11 (coord P5), FlexSPI_D3_A */
/* Routed pin properties */
#define BOARD_INITFLEXSPI_FlexSPI_D3_A_PERIPHERAL                        FLEXSPI   /*!< Peripheral name */
#define BOARD_INITFLEXSPI_FlexSPI_D3_A_SIGNAL                    FLEXSPI_A_DATA3   /*!< Signal name */

/* GPIO_SD_B1_07 (coord L4), FlexSPI_CLK */
/* Routed pin properties */
#define BOARD_INITFLEXSPI_FlexSPI_CLK_PERIPHERAL                         FLEXSPI   /*!< Peripheral name */
#define BOARD_INITFLEXSPI_FlexSPI_CLK_SIGNAL                      FLEXSPI_A_SCLK   /*!< Signal name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFlexSpi(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
